In [182]:
import warnings
warnings.filterwarnings("ignore")

In [183]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [184]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [185]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [186]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [187]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [188]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [189]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [190]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [191]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [192]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [193]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [194]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [195]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [196]:
users['reg_month'] = users['reg_date'].values.astype('datetime64[M]')

In [197]:
min_month = users['reg_date'].values.astype('datetime64[M]').min()

In [198]:
max_month = users['reg_date'].values.astype('datetime64[M]').max()

In [199]:
(min_month, max_month)

(numpy.datetime64('2018-01'), numpy.datetime64('2018-12'))

In [200]:
months = pd.DataFrame(pd.date_range(min_month, max_month, freq='MS'))

In [201]:
months

            0
0  2018-01-01
1  2018-02-01
2  2018-03-01
3  2018-04-01
4  2018-05-01
5  2018-06-01
6  2018-07-01
7  2018-08-01
8  2018-09-01
9  2018-10-01
10 2018-11-01
11 2018-12-01

In [202]:
months.columns = ['month']

In [203]:
len(users)*len(months)

6000

In [204]:
users['key'] = 1
months['key'] = 1

In [205]:
report = months.merge(users, on='key')

In [206]:
report.head()

,month,key,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month
0,2018-01-01,1,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN,2018-12-01
1,2018-01-01,1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN,2018-08-01
2,2018-01-01,1,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN,2018-10-01
3,2018-01-01,1,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN,2018-01-01
4,2018-01-01,1,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN,2018-05-01

In [207]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   month       6000 non-null   datetime64[ns]
 1   key         6000 non-null   int64
 2   user_id     6000 non-null   int64
 3   first_name  6000 non-null   object
 4   last_name   6000 non-null   object
 5   age         6000 non-null   int64
 6   city        6000 non-null   object
 7   reg_date    6000 non-null   object
 8   plan        6000 non-null   object
 9   churn_date  408 non-null    object
 10  reg_month   6000 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(6)
memory usage: 562.5+ KB

In [208]:
len(report[report['month']>=report['reg_month']]) #some users came after the minimal date

3355

In [209]:
report = report[report['month']>=report['reg_month']]

In [210]:
report = report[['month', 'key', 'user_id', 'city', 'plan', 'reg_month']]

In [211]:
#specific user
report[report['user_id'] == 1000]

,month,key,user_id,city,plan,reg_month
5500,2018-12-01,1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-12-01

In [212]:
report[report['user_id'] == 1003]

          month  key  user_id           city  plan  reg_month
3    2018-01-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
503  2018-02-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1003 2018-03-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1503 2018-04-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2003 2018-05-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2503 2018-06-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3003 2018-07-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3503 2018-08-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4003 2018-09-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4503 2018-10-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5003 2018-11-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5503 2018-12-01    1     1003  Tulsa, OK MSA  surf 2018-01-01

In [213]:
data_calls.head()

,user_id,city,plan,id,call_date,duration,month,count
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_93,2018-12-27,8.52,2018-12-01,1
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_145,2018-12-27,13.66,2018-12-01,1
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_247,2018-12-27,14.48,2018-12-01,1
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_309,2018-12-28,5.76,2018-12-01,1
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_380,2018-12-30,4.22,2018-12-01,1

In [214]:
data_calls['month'] = data_calls['call_date'].values.astype('datetime64[M]')

In [215]:
calls_month = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()

In [216]:
calls_month.sample(10)

     user_id      month duration
                             sum
883     1187 2018-04-01   534.33
239     1055 2018-11-01   221.20
2019    1438 2018-12-01   351.42
83      1023 2018-07-01    40.13
482     1101 2018-12-01   330.65
888     1187 2018-09-01   618.11
201     1049 2018-09-01   335.44
2214    1488 2018-09-01   604.84
2011    1436 2018-10-01   440.46
226     1054 2018-06-01   197.27

In [217]:
calls_month.columns = ['user_id', 'month', 'total_duration'] # maybe round up the duration at this point

In [218]:
user_plan = users[['user_id', 'plan']]

In [219]:
user_plan[user_plan['user_id'] == 1233] #testing

     user_id  plan
233     1233  surf

In [220]:
calls_month = calls_month.merge(user_plan, on='user_id', how='left')

In [221]:
plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [222]:
call_plan = plans[['plan_name', 'minutes_included']]

In [223]:
call_plan.columns = ['plan', 'plan_minutes']

In [224]:
call_plan

       plan  plan_minutes
0      surf           500
1  ultimate          3000

In [225]:
calls_month = calls_month.merge(call_plan, on='plan', how='left')

In [226]:
calls_month['extra_mins'] = calls_month['total_duration'] - calls_month['plan_minutes']

In [227]:
calls_month['extra_mins'] = calls_month['extra_mins'].round(0) #round up the minutes

In [228]:
#change mins to integer
calls_month['extra_mins'] = calls_month['extra_mins'].astype(np.int64)

In [229]:
def cost_calc(extra):
    if extra < 0:
        return 0
    if extra > 0:
        return extra

In [230]:
calls_month['extra_duration'] = calls_month['extra_mins'].apply(cost_calc)

In [231]:
extminute_plan = plans[['plan_name', 'usd_per_minute']]

In [232]:
extminute_plan.columns = ['plan', 'usd_per_minute']

In [233]:
calls_month = calls_month.merge(extminute_plan, on='plan', how='left')

In [234]:
calls_month['call_cost'] = calls_month['extra_duration'] * calls_month['usd_per_minute']

In [235]:
#callmnth_charge = plans[['']]

In [236]:
calls_month = calls_month[['user_id', 'month', 'call_cost']]

In [237]:
report = report.merge(calls_month, on=['user_id', 'month'], how='left')

In [238]:
report.shape

(3355, 7)

In [239]:
calls_month.shape

(2277, 3)

In [240]:
report.head()
#NaN are for users who did not make calls that month
#0.0 are for users who had no extra cost

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

In [54]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
 8   key         500 non-null    int64
 9   reg_month   500 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(6)
memory usage: 39.2+ KB

In [55]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [56]:
plans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   messages_included      2 non-null      int64
 1   mb_per_month_included  2 non-null      int64
 2   minutes_included       2 non-null      int64
 3   usd_monthly_pay        2 non-null      int64
 4   usd_per_gb             2 non-null      int64
 5   usd_per_message        2 non-null      float64
 6   usd_per_minute         2 non-null      float64
 7   plan_name              2 non-null      object
dtypes: float64(2), int64(5), object(1)
memory usage: 256.0+ bytes

In [57]:
#merge columns into users or join
#user_id, city, plan, call_date, duration, message_date, session_date, mb_used

In [241]:
data = users[['user_id', 'city', 'plan']]

In [59]:
data_calls = data.merge(calls, how='outer', on='user_id')

In [60]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [ ]:
hh

In [ ]:
hh

In [ ]:
hh

In [ ]:
hh

In [ ]:
hh

In [ ]:
hh

In [61]:
data_messages = data.merge(messages, how='outer', on='user_id')

In [62]:
data_messages.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76149 entries, 0 to 76148
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       76149 non-null  int64
 1   city          76149 non-null  object
 2   plan          76149 non-null  object
 3   id            76051 non-null  object
 4   message_date  76051 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.5+ MB

In [63]:
data_internet = data.merge(internet, how='outer', on='user_id')

In [64]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104836 entries, 0 to 104835
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104836 non-null  int64
 1   city          104836 non-null  object
 2   plan          104836 non-null  object
 3   id            104825 non-null  object
 4   session_date  104825 non-null  object
 5   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [65]:
#fill in missing values

In [66]:
data_calls.isnull().sum()

user_id       0
city          0
plan          0
id           19
call_date    19
duration     19
dtype: int64

In [67]:
#data_calls.loc[data_calls.duration.isnull()].head()

In [68]:
data_calls['id'] = data_calls['id'].fillna(value=0)
data_calls['call_date'] = data_calls['call_date'].fillna(method='ffill')
# to have a date during conversion
data_calls['duration'] = data_calls['duration'].fillna(value=0)

In [69]:
data_messages.isnull().sum()

user_id          0
city             0
plan             0
id              98
message_date    98
dtype: int64

In [70]:
#data_messages.loc[data_messages.message_date.isnull()].head()

In [71]:
data_messages['id'] = data_messages['id'].fillna(value=0)
data_messages['message_date'] = data_messages['message_date'].fillna(method='ffill')

In [72]:
data_internet.isnull().sum()

user_id          0
city             0
plan             0
id              11
session_date    11
mb_used         11
dtype: int64

In [73]:
#data_internet.loc[data_internet.id.isnull()].head()

In [74]:
data_internet['id'] = data_internet['id'].fillna(value=0)
data_internet['session_date'] = data_internet['session_date'].fillna(method='ffill')
data_internet['mb_used'] = data_internet['mb_used'].fillna(value=0)

In [75]:
#convert data types

In [76]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')
data_internet['session_date'] = pd.to_datetime(data_internet['session_date'], format='%Y-%m-%d')

In [77]:
#check for duplicates

In [78]:
data_calls.duplicated().sum()
data_messages.duplicated().sum()
data_internet.duplicated().sum()

0

In [79]:
#check for errors

In [80]:
data_calls.query('duration == -1')

Empty DataFrame
Columns: [user_id, city, plan, id, call_date, duration]
Index: []

In [81]:
data_internet.query('mb_used == -1')

Empty DataFrame
Columns: [user_id, city, plan, id, session_date, mb_used]
Index: []

In [82]:
#number of calls made per month

In [83]:
data_calls.sample(5)

,user_id,city,plan,id,call_date,duration
58941,1213,"San Diego-Chula Vista-Carlsbad, CA MSA",ultimate,1213_128,2018-12-06,11.88
6122,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,1029_285,2018-10-29,12.81
38232,1144,"New York-Newark-Jersey City, NY-NJ-PA MSA",ultimate,1144_104,2018-06-18,0.00
81388,1293,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,1293_292,2018-11-28,0.00
105298,1370,"San Diego-Chula Vista-Carlsbad, CA MSA",ultimate,1370_597,2018-09-25,5.87

In [84]:
data_calls['month'] = data_calls['call_date'].dt.month

In [85]:
data_calls['count'] = 1

In [86]:
calls_month = (data_calls
               .pivot_table(index='user_id', values='count', columns='month', aggfunc='count')
                .fillna(value=0)
)

In [87]:
calls_month.head()

month     1    2    3    4     5     6     7     8     9     10    11     12
user_id
1000     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   16.0
1001     0.0  0.0  0.0  0.0   0.0   0.0   0.0  27.0  49.0  65.0  64.0   56.0
1002     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  11.0  55.0   47.0
1003     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  149.0
1004     0.0  0.0  0.0  0.0  21.0  44.0  49.0  49.0  42.0  61.0  54.0   50.0

In [88]:
#minutes used per month

In [89]:
minutes_month = (data_calls
                 .pivot_table(index=['user_id', 'plan'], values='duration', columns=['month'], aggfunc='sum')
                .fillna(value=0)
)

In [90]:
minutes_month.head()

,month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,plan,,,,,,,,,,,,
1000,ultimate,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,116.83
1001,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,171.14,297.69,374.11,404.59,392.93
1002,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,54.13,359.76,363.24
1003,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1041.00
1004,surf,0.0,0.0,0.0,0.0,181.58,261.32,358.45,334.86,284.60,341.63,452.98,403.53

In [91]:
#messages per month

In [92]:
data_messages.head()

,user_id,city,plan,id,message_date
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26

In [93]:
data_messages['count'] = 1
data_messages['month'] = data_messages['message_date'].dt.month

In [94]:
msg_month = (data_messages
             .pivot_table(index='user_id', values='count', columns='month', aggfunc='sum')
             .fillna(value=0)
)

In [95]:
msg_month.head()

month     1    2    3    4    5     6     7     8     9     10    11    12
user_id
1000     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0  11.0
1001     0.0  0.0  0.0  0.0  0.0   0.0   0.0  30.0  44.0  53.0  36.0  44.0
1002     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0  15.0  32.0  41.0
1003     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0  50.0
1004     0.0  0.0  0.0  0.0  7.0  18.0  26.0  25.0  21.0  24.0  25.0  31.0

In [96]:
#data per month

In [97]:
data_internet.head()

,user_id,city,plan,id,session_date,mb_used
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_13,2018-12-29,89.86
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_204,2018-12-31,0.00
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_379,2018-12-28,660.40
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_413,2018-12-26,270.99
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_442,2018-12-27,880.22

In [98]:
data_internet['month'] = data_internet.session_date.dt.month

In [99]:
mb_month = (data_internet
            .pivot_table(index='user_id', values='mb_used', columns='month', aggfunc='sum')
            .fillna(value=0)
)

In [100]:
mb_month.head()

month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,,,,,,,,,,,,
1000,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1901.47
1001,0.0,0.0,0.0,0.0,0.00,0.00,0.00,6919.15,13314.82,22330.49,18504.30,19369.18
1002,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,6552.01,19345.08,14396.24
1003,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,27044.14
1004,0.0,0.0,0.0,0.0,6547.21,20672.82,24516.62,27981.74,18852.72,14541.63,21850.78,21389.29

In [101]:
#monthly profit from each user

In [102]:
minutes_month.head()

,month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,plan,,,,,,,,,,,,
1000,ultimate,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,116.83
1001,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,171.14,297.69,374.11,404.59,392.93
1002,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,54.13,359.76,363.24
1003,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1041.00
1004,surf,0.0,0.0,0.0,0.0,181.58,261.32,358.45,334.86,284.60,341.63,452.98,403.53

In [103]:
plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate